&НаКлиенте
Перем м_БуферОбмена;

#Область Форма

#Область События

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененБуферОбмена" Тогда
		м_БуферОбмена = Параметр;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Элементы
#КонецОбласти

#Область Таблицы

#Область Проекты

#Область Команды

&НаКлиенте
Процедура КомандаПроектыДобавитьГруппу(Команда)
	
	ПроектыДобавитьГруппуОбъектов();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПроектыДобавитьГруппуОбъектов()
	
	ИмяГруппы = "";
	ИмяГруппы = Ждать ВвестиЗначениеАсинх(ИмяГруппы, "Введите имя группы");
	
	Если Не ЗначениеЗаполнено(ИмяГруппы) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.Проекты.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		эл_Проекты = Проекты.ПолучитьЭлементы().Добавить();
		
	Иначе
		
		эл_ТекущаяСтрока = Проекты.НайтиПоИдентификатору(ТекущаяСтрока);
		эл_Проекты = эл_ТекущаяСтрока.ПолучитьЭлементы().Добавить();
		
	КонецЕсли;
	
	эл_Проекты.Тип = "Группа";
	эл_Проекты.Имя = ИмяГруппы;
	эл_Проекты.Значение = ИмяГруппы;
	эл_Проекты.Представление = ИмяГруппы;
	эл_Проекты.НомерКартинки = НомерКартинкиДереваПроектов(эл_Проекты.Тип);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьПроект(Команда)
	
	СохранитьПроектНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СохранитьПроектНаКлиенте()
	
	ПолноеИмяФайла = "";
	
	ТекущаяСтрока = Проекты.НайтиПоИдентификатору(Элементы.Проекты.ТекущаяСтрока);
	Если Не ТекущаяСтрока = Неопределено Тогда
		
		Если ТекущаяСтрока.Тип = "Проект" Тогда
			ПолноеИмяФайла = СтрШаблон("%1.json", ТекущаяСтрока.Имя);
		КонецЕсли;
		
	КонецЕсли;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Расширение = "json";
	ДиалогВыбораФайла.Фильтр = "Файлы JSON|*.json|";
	ДиалогВыбораФайла.Заголовок = "Укажите имя файла для сохранения проекта";
	ДиалогВыбораФайла.ПолноеИмяФайла = ПолноеИмяФайла;
	
	Ответ = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВставитьДанныеИзБуфераОбмена(Команда)
	
	#Область Предусловия
	
	Если м_БуферОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если м_БуферОбмена.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.Проекты.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаПроектов = Проекты.НайтиПоИдентификатору(ТекущаяСтрока);
	Если ТекущаяСтрокаПроектов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	БуферОбменаДополненный = ДополнитьДанныеБуфераОбмена(м_БуферОбмена);
	
	ЭлементыТекущейСтрокиПроектов = ТекущаяСтрокаПроектов.ПолучитьЭлементы();
	
	Для каждого эл_Буфер Из БуферОбменаДополненный Цикл
		
		ЕстьТакойЭлементВУзле = Ложь;
		
		Для каждого эл_Проекты Из ЭлементыТекущейСтрокиПроектов Цикл
			
			Если эл_Проекты.Значение = эл_Буфер.Ключ Тогда
				ЕстьТакойЭлементВУзле = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьТакойЭлементВУзле Тогда
			Продолжить;
		КонецЕсли;
		
		стр_ЭлементПроекта = ЭлементыТекущейСтрокиПроектов.Добавить();
		стр_ЭлементПроекта.Имя = эл_Буфер.Ключ;
		стр_ЭлементПроекта.Представление = эл_Буфер.Ключ;
		стр_ЭлементПроекта.Значение = эл_Буфер.Ключ;
		стр_ЭлементПроекта.Тип = эл_Буфер.Значение.ОбобщенныйТип;
		стр_ЭлементПроекта.НомерКартинки = НомерКартинкиДереваПроектов(стр_ЭлементПроекта.Тип);
		стр_ЭлементПроекта.Свойства = эл_Буфер.Значение.ЗначениеКакСтрокаВнутр;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДополнитьДанныеБуфераОбмена(БуферОбмена)
	
	Результат       = Новый Соответствие;
	ПустойРезультат = Новый Соответствие;
	
	#Область Предусловия
	
	Если БуферОбмена = Неопределено Тогда
		Возврат ПустойРезультат;
	КонецЕсли;
	
	#КонецОбласти
	
	Для каждого эл_БуферОбмена Из БуферОбмена Цикл
		
		Если эл_БуферОбмена = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваЭлемента = ПолучитьСвойстваЭлемента(эл_БуферОбмена);
		
		Результат.Вставить(эл_БуферОбмена, СвойстваЭлемента);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСвойстваЭлемента(ЭлементБуфераОбмена)
	
	Результат = Новый Структура();
	Результат.Вставить("ТипЭлементаПолный");
	Результат.Вставить("ТипОбъектаМетаданных");
	Результат.Вставить("ИмяОбъектаМетаданных");
	Результат.Вставить("ОбобщенныйТип");
	Результат.Вставить("НавигационнаяСсылка");
	Результат.Вставить("ЗначениеКакСтрокаВнутр");
	
	МетаданныеЭлемента = ЭлементБуфераОбмена.Метаданные();
	
	Результат.ТипЭлементаПолный    = ЭлементБуфераОбмена.Метаданные().ПолноеИмя();
	
	ЧастиСтроки = СтрРазделить(Результат.ТипЭлементаПолный, ".", Ложь);
	
	Результат.ТипОбъектаМетаданных = ЧастиСтроки[0];
	Результат.ИмяОбъектаМетаданных = ЧастиСтроки[1];
	
	Навигатор = РеквизитФормыВЗначение("Объект");
	Результат.НавигационнаяСсылка  = Навигатор.НавигационнаяСсылкаНаЭлемент(ЭлементБуфераОбмена);
	
	Если Результат.ТипОбъектаМетаданных = "Справочник" Тогда
		Результат.ОбобщенныйТип = "СправочникСсылка";
		
	ИначеЕсли Результат.ТипОбъектаМетаданных = "Документ" Тогда
		Результат.ОбобщенныйТип = "ДокументСсылка";
		
	ИначеЕсли Результат.ТипОбъектаМетаданных = "Перечисление" Тогда
		Результат.ОбобщенныйТип = "ПеречислениеСсылка";
		
	ИначеЕсли Результат.ТипОбъектаМетаданных = "ПланВидовХарактеристик" Тогда
		Результат.ОбобщенныйТип = "ПланВидовХарактеристикСсылка";
		
	ИначеЕсли Результат.ТипОбъектаМетаданных = "ПланВидовРасчета" Тогда
		Результат.ОбобщенныйТип = "ПланВидовРасчетаСсылка";
		
	КонецЕсли;
	
	Результат.ЗначениеКакСтрокаВнутр = ЗначениеВСтрокуВнутр(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КомандаДобавитьФайлВПроект(Команда)
	
	ДобавитьФайлВПроект();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДобавитьФайлВПроект()
	
	#Область Предусловия
	
	ТекущаяСтрока = Элементы.Проекты.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	стр_Проекты = Проекты.НайтиПоИдентификатору(ТекущаяСтрока);
	Если стр_Проекты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	// Выбрать файлы
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Истина;
	
	МассивВыбранныхФайлов = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	Если МассивВыбранныхФайлов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаДереваПроектов = стр_Проекты.ПолучитьЭлементы();
	
	Для каждого ПолноеИмяФайла Из МассивВыбранныхФайлов Цикл
		
		ЕстьФайлСТакимИменем = Ложь;
		
		Для каждого эл_Проекты Из ТекущаяСтрокаДереваПроектов Цикл
			
			Если эл_Проекты.Имя = ПолноеИмяФайла Тогда
				ЕстьФайлСТакимИменем = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьФайлСТакимИменем Тогда
			Продолжить;
		КонецЕсли;
		
		Файл = Новый Файл(ПолноеИмяФайла);
		
		НоваяСтрока = ТекущаяСтрокаДереваПроектов.Добавить();
		НоваяСтрока.Тип = "Файл";
		НоваяСтрока.Представление = Файл.Имя;
		НоваяСтрока.Значение = ПолноеИмяФайла;
		НоваяСтрока.Имя = ПолноеИмяФайла;
		НоваяСтрока.НомерКартинки = НомерКартинкиДереваПроектов(Файл.Расширение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьЭлемент(Команда)
	
	#Область Предусловия
	
	ТекущаяСтрока = Элементы.Проекты.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	стр_Проекты = Проекты.НайтиПоИдентификатору(ТекущаяСтрока);
	
	ПараметрыОткрытия = Новый Структура("ОбъектБазы", стр_Проекты.Значение);
	
	ПолноеИмяФормы = ПолноеИмяФормыОбработки(ЭтаФорма.ИмяФормы, "РедакторОбъекта");
	ОткрытьФорму(ПолноеИмяФормы, ПараметрыОткрытия, ЭтаФорма, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область События

&НаКлиенте
Процедура ПроектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ПередНачаломДобавленияПроекта();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПередНачаломДобавленияПроекта()
	
	ИмяПроекта = "";
	ИмяПроекта = Ждать ВвестиЗначениеАсинх(ИмяПроекта, "Введите имя проекта");
	
	Если Не ЗначениеЗаполнено(ИмяПроекта) Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьПроектСТакимИменем = Ложь;
	
	эл_ВсеПроекты = Проекты.ПолучитьЭлементы();
	
	Для каждого эл_Проекты Из эл_ВсеПроекты Цикл
		
		Если эл_Проекты.Имя = ИмяПроекта Тогда
			ЕстьПроектСТакимИменем = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьПроектСТакимИменем Тогда
		ПоказатьПредупреждение(, СтрШаблон("Уже есть проект с таким именем: '%1'", ИмяПроекта));
		Возврат;
	КонецЕсли;
	
	эл_Проекты = Проекты.ПолучитьЭлементы().Добавить();
	эл_Проекты.Имя = ИмяПроекта;
	эл_Проекты.Значение = ИмяПроекта;
	эл_Проекты.Представление = ИмяПроекта;
	эл_Проекты.Тип = "Проект";
	эл_Проекты.НомерКартинки = НомерКартинкиДереваПроектов(эл_Проекты.Тип);
	
	эл_ГруппаСсылки = эл_Проекты.ПолучитьЭлементы().Добавить();
	эл_ГруппаСсылки.Имя = "Ссылки";
	эл_ГруппаСсылки.Значение = "Ссылки";
	эл_ГруппаСсылки.Представление = "Ссылки";
	эл_ГруппаСсылки.Тип = "Группа";
	эл_ГруппаСсылки.НомерКартинки = НомерКартинкиДереваПроектов(эл_ГруппаСсылки.Тип);
	
	эл_ГруппаСсылки = эл_Проекты.ПолучитьЭлементы().Добавить();
	эл_ГруппаСсылки.Имя = "Формы";
	эл_ГруппаСсылки.Значение = "Формы";
	эл_ГруппаСсылки.Представление = "Формы";
	эл_ГруппаСсылки.Тип = "Группа";
	эл_ГруппаСсылки.НомерКартинки = НомерКартинкиДереваПроектов(эл_ГруппаСсылки.Тип);
	
	эл_ГруппаСсылки = эл_Проекты.ПолучитьЭлементы().Добавить();
	эл_ГруппаСсылки.Имя = "Скрипты";
	эл_ГруппаСсылки.Значение = "Скрипты";
	эл_ГруппаСсылки.Представление = "Скрипты";
	эл_ГруппаСсылки.Тип = "Группа";
	эл_ГруппаСсылки.НомерКартинки = НомерКартинкиДереваПроектов(эл_ГруппаСсылки.Тип);
	
	эл_ГруппаСсылки = эл_Проекты.ПолучитьЭлементы().Добавить();
	эл_ГруппаСсылки.Имя = "Файлы";
	эл_ГруппаСсылки.Значение = "Файлы";
	эл_ГруппаСсылки.Представление = "Файлы";
	эл_ГруппаСсылки.Тип = "Группа";
	эл_ГруппаСсылки.НомерКартинки = НомерКартинкиДереваПроектов(эл_ГруппаСсылки.Тип);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	//
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	#Область Предусловия
	
	ДанныеИсточникаПеретаскивания = Неопределено;
	
	Если ЗначениеЗаполнено(ИмяЭлементаИсточникаПриПеретаскивании) Тогда
		ДанныеИсточникаПеретаскивания = Элементы[ИмяЭлементаИсточникаПриПеретаскивании].ТекущиеДанные;
	КонецЕсли;
	
	Если ДанныеИсточникаПеретаскивания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	// ИмяЭлементаИсточникаПриПеретаскивании
	
	ТекущаяСтрока = Элементы.Проекты.ТекущаяСтрока;
	
	Если Не (ТекущаяСтрока = Неопределено) Тогда
		стр_Проекты = Проекты.НайтиПоИдентификатору(ТекущаяСтрока);
	КонецЕсли;
	
	Если стр_Проекты = Неопределено Тогда
		эл_ВсеПроекты = Проекты.ПолучитьЭлементы();
	Иначе
		эл_ВсеПроекты = стр_Проекты.ПолучитьЭлементы();
	КонецЕсли;
	
	стр_Проекты = эл_ВсеПроекты.Добавить();
	
	ЗаполнитьЗначенияСвойств(стр_Проекты, ДанныеИсточникаПеретаскивания);
	
	стр_Проекты.Тип = "Ссылка";
	стр_Проекты.Имя           = ДанныеИсточникаПеретаскивания.Ссылка;
	стр_Проекты.Представление = ДанныеИсточникаПеретаскивания.Ссылка;
	стр_Проекты.Значение      = ДанныеИсточникаПеретаскивания.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	//
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	//
	
КонецПроцедуры

#КонецОбласти

#Область Методы

&НаКлиенте
Функция НомерКартинкиДереваПроектов(ОпределительОбъекта)
	
	Результат = 78; // Пустая картинка
	ПустойРезультат = 78; // Пустая картинка
	
	Если Не ЗначениеЗаполнено(ОпределительОбъекта) Тогда
		Возврат ПустойРезультат;
		
	ИначеЕсли ОпределительОбъекта = "СправочникСсылка" Тогда
		Возврат 0;
		
	ИначеЕсли ОпределительОбъекта = "Группа" Тогда
		Возврат 80;
		
	ИначеЕсли ОпределительОбъекта = "Проект" Тогда
		Возврат 79;
		
	ИначеЕсли СтрНайти(".dt;.1cd;.cf;.cfu;", ОпределительОбъекта) <> 0 Тогда
		Возврат 6; // Файлы 1С.
		
	ИначеЕсли ОпределительОбъекта = ".mxl;" Тогда
		Возврат 8; // Табличный Файл.
		
	ИначеЕсли СтрНайти(".txt;.log;.ini;", ОпределительОбъекта) <> 0 Тогда
		Возврат 10; // Текстовый Файл.
		
	ИначеЕсли ОпределительОбъекта = ".epf;" Тогда
		Возврат 12; // Внешние обработки.
		
	ИначеЕсли СтрНайти(".ico;.wmf;.emf;",ОпределительОбъекта) <> 0 Тогда
		Возврат 14; // Картинки.
		
	ИначеЕсли СтрНайти(".htm;.html;.url;.mht;.mhtml;",ОпределительОбъекта) <> 0 Тогда
		Возврат 16; // HTML.
		
	ИначеЕсли СтрНайти(".doc;.dot;.rtf;",ОпределительОбъекта) <> 0 Тогда
		Возврат 18; // Файл Microsoft Word.
		
	ИначеЕсли СтрНайти(".xls;.xlw;",ОпределительОбъекта) <> 0 Тогда
		Возврат 20; // Файл Microsoft Excel.
		
	ИначеЕсли СтрНайти(".ppt;.pps;",ОпределительОбъекта) <> 0 Тогда
		Возврат 22; // Файл Microsoft PowerPoint.
		
	ИначеЕсли СтрНайти(".vsd;",ОпределительОбъекта) <> 0 Тогда
		Возврат 24; // Файл Microsoft Visio.
		
	ИначеЕсли СтрНайти(".mpp;",ОпределительОбъекта) <> 0 Тогда
		Возврат 26; // Файл Microsoft Visio.
		
	ИначеЕсли СтрНайти(".mdb;.adp;.mda;.mde;.ade;.accdb;",ОпределительОбъекта) <> 0 Тогда
		Возврат 28; // База данных Microsoft Access.
		
	ИначеЕсли СтрНайти(".xml;",ОпределительОбъекта) <> 0 Тогда
		Возврат 30; // xml.
		
	ИначеЕсли СтрНайти(".msg;.eml;",ОпределительОбъекта) <> 0 Тогда
		Возврат 32; // Письмо электронной почты.
		
	ИначеЕсли СтрНайти(".zip;.rar;.arj;.cab;.lzh;.ace;",ОпределительОбъекта) <> 0 Тогда
		Возврат 34; // Архивы.
		
	ИначеЕсли СтрНайти(".exe;.com;.bat;.cmd;",ОпределительОбъекта) <> 0 Тогда
		Возврат 36; // Исполняемые файлы.
		
	ИначеЕсли СтрНайти(".grs;",ОпределительОбъекта) <> 0 Тогда
		Возврат 38; // Графическая схема.
		
	ИначеЕсли СтрНайти(".geo;",ОпределительОбъекта) <> 0 Тогда
		Возврат 40; // Географическая схема.
		
	ИначеЕсли СтрНайти(".jpg;.jpeg;.jp2;.jpe;",ОпределительОбъекта) <> 0 Тогда
		Возврат 42; // jpg.
		
	ИначеЕсли СтрНайти(".bmp;.dib;",ОпределительОбъекта) <> 0 Тогда
		Возврат 44; // bmp.
		
	ИначеЕсли СтрНайти(".tif;.tiff;",ОпределительОбъекта) <> 0 Тогда
		Возврат 46; // tif.
		
	ИначеЕсли СтрНайти(".gif;",ОпределительОбъекта) <> 0 Тогда
		Возврат 48; // gif.
		
	ИначеЕсли СтрНайти(".png;",ОпределительОбъекта) <> 0 Тогда
		Возврат 50; // png.
		
	ИначеЕсли СтрНайти(".pdf;",ОпределительОбъекта) <> 0 Тогда
		Возврат 52; // pdf.
		
	ИначеЕсли СтрНайти(".odt;",ОпределительОбъекта) <> 0 Тогда
		Возврат 54; // Open Office writer.
		
	ИначеЕсли СтрНайти(".odf;",ОпределительОбъекта) <> 0 Тогда
		Возврат 56; // Open Office math.
		
	ИначеЕсли СтрНайти(".odp;",ОпределительОбъекта) <> 0 Тогда
		Возврат 58; // Open Office Impress.
		
	ИначеЕсли СтрНайти(".odg;",ОпределительОбъекта) <> 0 Тогда
		Возврат 60; // Open Office draw.
		
	ИначеЕсли СтрНайти(".ods;",ОпределительОбъекта) <> 0 Тогда
		Возврат 62; // Open Office calc.
		
	ИначеЕсли СтрНайти(".mp3;",ОпределительОбъекта) <> 0 Тогда
		Возврат 64;
		
	ИначеЕсли СтрНайти(".erf;",ОпределительОбъекта) <> 0 Тогда
		Возврат 66; // Внешние отчеты.
		
	ИначеЕсли СтрНайти(".docx;",ОпределительОбъекта) <> 0 Тогда
		Возврат 68; // Файл Microsoft Word docx.
		
	ИначеЕсли СтрНайти(".xlsx;",ОпределительОбъекта) <> 0 Тогда
		Возврат 70; // Файл Microsoft Excel xlsx.
		
	ИначеЕсли СтрНайти(".pptx;",ОпределительОбъекта) <> 0 Тогда
		Возврат 72; // Файл Microsoft PowerPoint pptx.
		
	ИначеЕсли СтрНайти(".p7s;",ОпределительОбъекта) <> 0 Тогда
		Возврат 74; // Файл подписи.
		
	ИначеЕсли СтрНайти(".p7m;",ОпределительОбъекта) <> 0 Тогда
		Возврат 76; // зашифрованное сообщение.
		
	Иначе
		Возврат ПустойРезультат;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область Команды
#КонецОбласти

#КонецОбласти

#Область Методы

&НаКлиентеНаСервереБезКонтекста
Функция ПолноеИмяФормыОбработки(ИмяТекущейФормы, ИмяФормыОбработки) Экспорт
	
	Результат       = "";
	ПустойРезультат = "";
	
	#Область Предусловия
	
	Если Не ЗначениеЗаполнено(ИмяТекущейФормы) Тогда
		Возврат ПустойРезультат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяФормыОбработки) Тогда
		Возврат ПустойРезультат;
	КонецЕсли;
	
	#КонецОбласти
	
	ЧастиСтроки = СтрРазделить(ИмяТекущейФормы, ".", Ложь);
	
	Результат = СтрШаблон("%1.%2.%3.%4", ЧастиСтроки[0], ЧастиСтроки[1], ЧастиСтроки[2], ИмяФормыОбработки);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Подключаемые
#КонецОбласти